Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMoveByConnector Property
 Cannot move analytical surface because it will disconnect the analytical nodes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalSurfaceCannotMoveByConnector { get; }
Public Shared ReadOnly Property AnalyticalSurfaceCannotMoveByConnector As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalSurfaceCannotMoveByConnector {
	FailureDefinitionId^ get ();
}
static member AnalyticalSurfaceCannotMoveByConnector : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace